import React, { createContext, useState } from 'react';

export const MaqolaContext = createContext();

export const MaqolaProvider = (props) => {
    const [maqola, setMaqola] = useState(
        {
            id: 1,
            title: "Мавлоно Ориф Деггароний' - ўн аср ортидаги кўҳна масжид",
            countryName: "Ўзбекистон",
            date: "25 январь 2019",
            numberView: "297 просмотров",
            description: "Кармана туманининг Ҳазара қишлоғида, ҳозирги Навоий вилоятининг энг қадимий масжиди бўлмиш Мавлоно Ориф Деггароний жоме масжиди жойлашган. Масжиднинг қачон қурилганлиги тўғрисида турли маълумотлар бор. 1951 йилда яна қайта текширув ишларини олиб борган Варонина исмли тадқиқотчи Деггарон масжиди XI асрда қурилган деган сўнгги хулосани берган. Масжид Деггарон қишлоғи ҳудудида бўлгани учун шу ном билан аталган. “Деггарон” сўзи  “қозон ясовчи” маъносини билдириб, қишлоқда қозон ясовчи ҳунармандлар истиқомат қилган. 1910 йил, 1328 ҳижрий санада Бухоро амири Абдулаҳадхон томонидан масжиднинг олди ва бир ён томонига айвон қурилган. Бу айвонлар 1980 йилларгача мавжуд бўлган. Хўш, масжиднинг Мавлоно Ориф Деггароний деб аталишининг сабаби нима? Мавлоно Ориф Деггароний ҳазратлари 1313 йилда Ҳазора қишлоғининг Деггарон даҳасида туғилган. Асл касби дўкондор бўлиб, бўз тўқиш билан шуғулланган. Мавлоно Ориф ҳазратлари Саид Амир Кулолнинг энг яқин шогирдларидан бири бўлиб, улкан аллома, атоқли тарбиячи, хожагон-нақшбандия тариқати ривожига муҳим ҳисса қўшган соҳиби каромат зот бўлган. Мавлоно Ориф XIV-асрда, тахминан 1313-1380 йиллар атрофида яшаб ўтган.  Қабрлари Деггарон масжиди яқинида бўлгани учун, масжид ҳам Мавлоно Ориф Деггароний деб аталган. Юртмимиз мустақилликка эришгач, диёримиздаги зиёратгоҳлар, азиз авлиёларнинг қабр ва қадамжоларини обод қилиш, тарихий обидаларни таъмирлаш, уларни асл ҳолатига келтириш учун саъй-ҳаракатлар бошланди ва кўплаб улуғ манзиллар обод қилинди. Шулар қаторида 2007 йил 'Мавлоно Ориф Деггароний' жоме масжиди катта зиёратгоҳ ва кўркам манзилга айлантирилди.",
            img: "https://za.egypttoursportal.com/2018/10/Architecture-of-Al-Azhar-Mosque-Egypt-Tours-Portal.jpg"

        }
    );

    return (
        <MaqolaContext.Provider value={[maqola, setMaqola]}>
            {props.children}
        </MaqolaContext.Provider>
    )
}